Repository: avgx/SSLPinning
Catalog: Sources/SSLPinning/Resources/Localizable.xcstrings
Source language: en
Languages: ru

# sslpinning.invalid_server_trust.error_description
source: Unable to verify the server’s identity for %@.
ru: Не удалось подтвердить подлинность сервера для %@.

# sslpinning.invalid_server_trust.failure_reason
source: The secure connection could not be validated because server trust data was missing, empty, or invalid.
ru: Защищённое соединение не удалось проверить: данные доверия к серверу отсутствуют, пусты или недопустимы.

# sslpinning.invalid_server_trust.recovery_suggestion
source: Retry after the server is fixed, or contact the service operator if this continues.
ru: Повторите попытку после устранения неполадок на сервере или обратитесь к администратору сервиса, если сообщение повторяется.

# sslpinning.fingerprint_mismatch.error_description
source: The server’s certificate or public key does not match the pin stored for %@.
ru: Сертификат или открытый ключ сервера не совпадает с сохранённым для %@ отпечатком.

# sslpinning.fingerprint_mismatch.failure_reason
source: Configured pin (serial %1$@, certificate SHA-256 %2$@) does not match the chain from the server (first leaf certificate SHA-256: %3$@).
ru: Настроенный отпечаток (серийный номер %1$@, SHA-256 сертификата %2$@) не совпадает с цепочкой от сервера (SHA-256 листового сертификата: %3$@).

# sslpinning.fingerprint_mismatch_spki.failure_reason
source: Configured SPKI pin (SHA-256 %1$@) does not match the chain from the server (first leaf SPKI SHA-256: %2$@).
ru: Настроенный SPKI-отпечаток (SHA-256 %1$@) не совпадает с цепочкой от сервера (SPKI SHA-256 листового сертификата: %2$@).

# sslpinning.fingerprint_mismatch.recovery_suggestion
source: Do not bypass this warning. Update the server certificate or change your pin only after you have verified the new certificate out of band.
ru: Не игнорируйте это предупреждение. Обновите сертификат сервера или измените отпечаток только после того, как проверите новый сертификат вне приложения.

# sslpinning.unknown_host.error_description
source: No certificate pin is configured for %@.
ru: Для %@ не настроен отпечаток сертификата.

# sslpinning.unknown_host.failure_reason
source: The server presented a certificate chain; first leaf SHA-256: %@. Inspect it before trusting this host.
ru: Сервер представил цепочку сертификатов; SHA-256 листового сертификата: %@. Проверьте её перед тем как доверять этому узлу.

# sslpinning.unknown_host.recovery_suggestion
source: Add a pin for this host in your app configuration and retry once you intentionally trust this server.
ru: Добавьте отпечаток для этого узла в настройках приложения и повторите попытку, если вы сознательно доверяете этому серверу.

# sslpinning.policy.pinning.description
source: Allow only hosts whose certificate matches a configured fingerprint.
ru: Разрешать только узлы, сертификат которых совпадает с настроенным отпечатком.

# sslpinning.policy.pinning_spki.description
source: Allow only hosts whose public key (SPKI) matches a configured hash.
ru: Разрешать только узлы, открытый ключ (SPKI) которых совпадает с настроенным хешем.

# sslpinning.policy.system.description
source: Use the system trust store; no app-level pinning.
ru: Использовать системное хранилище доверия; без пининга на уровне приложения.

# sslpinning.policy.trust_everyone.description
source: Accept any server certificate (insecure; debugging only).
ru: Принимать любой сертификат сервера (небезопасно; только для отладки).

# sslpinning.system_trust_failed.error_description
source: The system could not establish a trusted TLS connection.
ru: Системе не удалось установить доверенное TLS-соединение.

# sslpinning.system_trust_failed.failure_reason_header
source: Reason: %@
ru: Причина: %@

# sslpinning.system_trust_failed.recovery_suggestion
source: Check the device date and time, network, VPN, and whether a proxy or firewall is intercepting HTTPS. For corporate networks, install the required trust anchors if appropriate.
ru: Проверьте дату и время на устройстве, сеть, VPN, а также не перехватывает ли прокси или брандмауэр HTTPS. В корпоративной сети при необходимости установите доверенные корневые сертификаты.

# sslpinning.url_error.client_certificate_rejected
source: The server rejected the client certificate.
ru: Сервер отклонил клиентский сертификат.

# sslpinning.url_error.client_certificate_required
source: The server requires a client certificate.
ru: Сервер требует клиентский сертификат.

# sslpinning.url_error.generic_tls
source: A TLS or certificate error occurred.
ru: Произошла ошибка TLS или сертификата.

# sslpinning.url_error.secure_connection_failed
source: A secure connection to the server could not be made.
ru: Не удалось установить защищённое соединение с сервером.

# sslpinning.url_error.server_certificate_bad_date
source: The server certificate has an invalid date range.
ru: У сертификата сервера недопустимый диапазон дат.

# sslpinning.url_error.server_certificate_not_yet_valid
source: The server certificate is not yet valid.
ru: Сертификат сервера ещё не действителен.

# sslpinning.url_error.server_certificate_unknown_root
source: The server certificate chains to an unknown root.
ru: Цепочка сертификата сервера ведёт к неизвестному корневому центру.

# sslpinning.url_error.server_certificate_untrusted
source: The server certificate was not trusted.
ru: Сертификату сервера не доверяют.
